streetCanyon_CFDHAM_veg/constant/IDN
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       scalarList;
    location    "constant";
    object      Eb;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


24
(
0
0
0
0
0
39.6313696684973
426.648046551106
635.274602195092
742.703353938542
803.438263599227
839.095960996180
859.210136913615
868.183855842073
867.764220533819
857.872456789000
836.568477043080
799.118996088052
735.282218114877
621.633886776515
398.691015145320
15.3402501019625
0
0
0
)


// ************************************************************************* //
