streetCanyon_CFDHAM_veg/constant/Idif
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       scalarList;
    location    "constant";
    object      Ed;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


24
(
0
0
0
0
0
5.31060353557864
57.1708382378482
85.1267966941423
99.5222494277647
107.660727322296
112.438858773488
115.134158346424
116.336636682838
116.280405551532
114.954909209726
112.100175923773
107.081945475799
98.5278172273936
83.2989408280530
53.4245960294729
2.05559351366297
0
0
0
)


// ************************************************************************* //
