streetCanyon_CFDHAM_veg/constant/air/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
   version     2.0;
   format      ascii;
   class       dictionary;
   object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
  (0 0 0)
  (50 0 0)
  (60 0 0)
  (70 0 0)
  (80 0 0)
  (230 0 0)
  (0 10 0)
  (50 10 0)
  (60 10 0)
  (70 10 0)
  (80 10 0)
  (230 10 0)
  (0 60 0)
  (50 60 0)
  (60 60 0)
  (70 60 0)
  (80 60 0)
  (230 60 0)
  (0 0 100)
  (50 0 100)
  (60 0 100)
  (70 0 100)
  (80 0 100)
  (230 0 100)
  (0 10 100)
  (50 10 100)
  (60 10 100)
  (70 10 100)
  (80 10 100)
  (230 10 100)
  (0 60 100)
  (50 60 100)
  (60 60 100)
  (70 60 100)
  (80 60 100)
  (230 60 100)
  (0 0 150)
  (50 0 150)
  (60 0 150)
  (70 0 150)
  (80 0 150)
  (230 0 150)
  (0 10 150)
  (50 10 150)
  (60 10 150)
  (70 10 150)
  (80 10 150)
  (230 10 150)
  (0 60 150)
  (50 60 150)
  (60 60 150)
  (70 60 150)
  (80 60 150)
  (230 60 150)
  (0 0 250)
  (50 0 250)
  (60 0 250)
  (70 0 250)
  (80 0 250)
  (230 0 250)
  (0 10 250)
  (50 10 250)
  (60 10 250)
  (70 10 250)
  (80 10 250)
  (230 10 250)
  (0 60 250)
  (50 60 250)
  (60 60 250)
  (70 60 250)
  (80 60 250)
  (230 60 250)
);
 
blocks
(
  hex (0 1 7 6 18 19 25 24) (30 34 37) simpleGrading (1.45500688749335E-02 ((0.5 0.5 6.34321679385097)(0.5 0.5 0.15764872)) 7.89135349905273E-03)
  hex (1 2 8 7 19 20 26 25) (34 34 37) simpleGrading (((0.5 0.5 6.34321679385097)(0.5 0.5 0.15764872)) ((0.5 0.5 6.34321679385097)(0.5 0.5 0.15764872)) 7.89135349905273E-03)
  hex (2 3 9 8 20 21 27 26) (34 34 37) simpleGrading (((0.5 0.5 6.34321679385097)(0.5 0.5 0.15764872)) ((0.5 0.5 6.34321679385097)(0.5 0.5 0.15764872)) 7.89135349905273E-03)
  hex (3 4 10 9 21 22 28 27) (34 34 37) simpleGrading (((0.5 0.5 6.34321679385097)(0.5 0.5 0.15764872)) ((0.5 0.5 6.34321679385097)(0.5 0.5 0.15764872)) 7.89135349905273E-03)
  hex (4 5 11 10 22 23 29 28) (29 34 37) simpleGrading (273.164007479249 ((0.5 0.5 6.34321679385097)(0.5 0.5 0.15764872)) 7.89135349905273E-03)
  hex (6 7 13 12 24 25 31 30) (30 30 37) simpleGrading (1.45500688749335E-02 68.7281970039126 7.89135349905273E-03)
  hex (7 8 14 13 25 26 32 31) (34 30 37) simpleGrading (((0.5 0.5 6.34321679385097)(0.5 0.5 0.15764872)) 68.7281970039126 7.89135349905273E-03)
  hex (8 9 15 14 26 27 33 32) (34 30 37) simpleGrading (((0.5 0.5 6.34321679385097)(0.5 0.5 0.15764872)) 68.7281970039126 7.89135349905273E-03)
  hex (9 10 16 15 27 28 34 33) (34 30 37) simpleGrading (((0.5 0.5 6.34321679385097)(0.5 0.5 0.15764872)) 68.7281970039126 7.89135349905273E-03)
  hex (10 11 17 16 28 29 35 34) (29 30 37) simpleGrading (273.164007479249 68.7281970039126 7.89135349905273E-03)
  hex (18 19 25 24 36 37 43 42) (30 34 52) simpleGrading (1.45500688749335E-02 ((0.5 0.5 6.34321679385097)(0.5 0.5 0.15764872)) ((0.5 0.5 33.6747785419985)(0.5 0.5 0.029695815)))
  hex (20 21 27 26 38 39 45 44) (34 34 52) simpleGrading (((0.5 0.5 6.34321679385097)(0.5 0.5 0.15764872)) ((0.5 0.5 6.34321679385097)(0.5 0.5 0.15764872)) ((0.5 0.5 33.6747785419985)(0.5 0.5 0.029695815)))
  hex (22 23 29 28 40 41 47 46) (29 34 52) simpleGrading (273.164007479249 ((0.5 0.5 6.34321679385097)(0.5 0.5 0.15764872)) ((0.5 0.5 33.6747785419985)(0.5 0.5 0.029695815)))
  hex (24 25 31 30 42 43 49 48) (30 30 52) simpleGrading (1.45500688749335E-02 68.7281970039126 ((0.5 0.5 33.6747785419985)(0.5 0.5 0.029695815)))
  hex (25 26 32 31 43 44 50 49) (34 30 52) simpleGrading (((0.5 0.5 6.34321679385097)(0.5 0.5 0.15764872)) 68.7281970039126 ((0.5 0.5 33.6747785419985)(0.5 0.5 0.029695815)))
  hex (26 27 33 32 44 45 51 50) (34 30 52) simpleGrading (((0.5 0.5 6.34321679385097)(0.5 0.5 0.15764872)) 68.7281970039126 ((0.5 0.5 33.6747785419985)(0.5 0.5 0.029695815)))
  hex (27 28 34 33 45 46 52 51) (34 30 52) simpleGrading (((0.5 0.5 6.34321679385097)(0.5 0.5 0.15764872)) 68.7281970039126 ((0.5 0.5 33.6747785419985)(0.5 0.5 0.029695815)))
  hex (28 29 35 34 46 47 53 52) (29 30 52) simpleGrading (273.164007479249 68.7281970039126 ((0.5 0.5 33.6747785419985)(0.5 0.5 0.029695815)))
  hex (36 37 43 42 54 55 61 60) (30 34 37) simpleGrading (1.45500688749335E-02 ((0.5 0.5 6.34321679385097)(0.5 0.5 0.15764872)) 126.72097375862)
  hex (37 38 44 43 55 56 62 61) (34 34 37) simpleGrading (((0.5 0.5 6.34321679385097)(0.5 0.5 0.15764872)) ((0.5 0.5 6.34321679385097)(0.5 0.5 0.15764872)) 126.72097375862)
  hex (38 39 45 44 56 57 63 62) (34 34 37) simpleGrading (((0.5 0.5 6.34321679385097)(0.5 0.5 0.15764872)) ((0.5 0.5 6.34321679385097)(0.5 0.5 0.15764872)) 126.72097375862)
  hex (39 40 46 45 57 58 64 63) (34 34 37) simpleGrading (((0.5 0.5 6.34321679385097)(0.5 0.5 0.15764872)) ((0.5 0.5 6.34321679385097)(0.5 0.5 0.15764872)) 126.72097375862)
  hex (40 41 47 46 58 59 65 64) (29 34 37) simpleGrading (273.164007479249 ((0.5 0.5 6.34321679385097)(0.5 0.5 0.15764872)) 126.72097375862)
  hex (42 43 49 48 60 61 67 66) (30 30 37) simpleGrading (1.45500688749335E-02 68.7281970039126 126.72097375862)
  hex (43 44 50 49 61 62 68 67) (34 30 37) simpleGrading (((0.5 0.5 6.34321679385097)(0.5 0.5 0.15764872)) 68.7281970039126 126.72097375862)
  hex (44 45 51 50 62 63 69 68) (34 30 37) simpleGrading (((0.5 0.5 6.34321679385097)(0.5 0.5 0.15764872)) 68.7281970039126 126.72097375862)
  hex (45 46 52 51 63 64 70 69) (34 30 37) simpleGrading (((0.5 0.5 6.34321679385097)(0.5 0.5 0.15764872)) 68.7281970039126 126.72097375862)
  hex (46 47 53 52 64 65 71 70) (29 30 37) simpleGrading (273.164007479249 68.7281970039126 126.72097375862)
);
 
edges
(
);
 
patches
(
  patch inlet
  (
      (0 18 24 6)
      (6 24 30 12)
      (18 36 42 24)
      (24 42 48 30)
      (36 54 60 42)
      (42 60 66 48)
  )
  patch outlet
  (
      (5 23 29 11)
      (11 29 35 17)
      (23 41 47 29)
      (29 47 53 35)
      (41 59 65 47)
      (47 65 71 53)
  )
  slip top
  (
      (12 13 31 30)
      (13 14 32 31)
      (14 15 33 32)
      (15 16 34 33)
      (16 17 35 34)
      (30 31 49 48)
      (31 32 50 49)
      (32 33 51 50)
      (33 34 52 51)
      (34 35 53 52)
      (48 49 67 66)
      (49 50 68 67)
      (50 51 69 68)
      (51 52 70 69)
      (52 53 71 70)
  )
  wall ground
  (
      (0 1 19 18)
      (1 2 20 19)
      (2 3 21 20)
      (3 4 22 21)
      (4 5 23 22)
      (18 19 37 36)
      (22 23 41 40)
      (36 37 55 54)
      (37 38 56 55)
      (38 39 57 56)
      (39 40 58 57)
      (40 41 59 58)
  )
  wall air_to_street
  (	  
      (20 21 39 38)  
  )
  wall air_to_windward
  (
      (21 27 45 39) 
  )  
  wall air_to_leeward
  (
      (20 26 44 38) 
  )  
  slip side1
  (
      (0 1 7 6)
      (1 2 8 7)
      (2 3 9 8)
      (3 4 10 9)
      (4 5 11 10)
      (6 7 13 12)
      (7 8 14 13)
      (8 9 15 14)
      (9 10 16 15)
      (10 11 17 16)
  )  
  slip side2
  (	
      (54 55 61 60)
      (55 56 62 61)
      (56 57 63 62)
      (57 58 64 63)
      (58 59 65 64)
      (60 61 67 66)
      (61 62 68 67)
      (62 63 69 68)
      (63 64 70 69)
      (64 65 71 70)
  )
);
 
mergePatchPairs
(
);

// ************************************************************************* //
