streetCanyon_CFDHAM_veg/constant/street/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
   version     2.0;
   format      ascii;
   class       dictionary;
   object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
  (60.00 -2.00 100.00)
  (70.00 -2.00 100.00)
  (60.00 -0.10 100.00)
  (70.00 -0.10 100.00)
  (60.00  0.00 100.00)
  (70.00  0.00 100.00) 
  (60.00 -2.00 150.00)
  (70.00 -2.00 150.00)
  (60.00 -0.10 150.00)
  (70.00 -0.10 150.00)
  (60.00  0.00 150.00)
  (70.00  0.00 150.00)   
);
 
blocks
(
  hex (2 3 5 4 8 9 11 10) (20 100 100) simpleGrading (1 ((0.5 0.5 100)(0.5 0.5 0.01)) 1)
  hex (0 1 3 2 6 7 9 8) (20 20 100) simpleGrading (1 0.0023569 1)
);
 
edges
(
);
 
patches
(
  patch street_to_air
  (
      (4 5 11 10)
  )
  patch bottom
  (
      (0 1 7 6)
  )
  patch sides
  (
      (2 4 10 8)
	  (0 2 8 6)
	  (1 3 9 7)
	  (3 5 11 9)
	  (0 1 3 2)
	  (2 3 5 4)
	  (6 7 9 8)
	  (8 9 11 10)
  )
);
 
mergePatchPairs
(
);

// ************************************************************************* //
