streetCanyon_CFDHAM_veg/constant/sunPosVector
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       vectorList;
    location    "constant";
    object      sunPosVector;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

24
(
(	-0.1088158501	-0.3242085343	-0.9397063036	)
(	0.1306587458	-0.3222608312	-0.9375906617	)
(	0.361229164	-0.278399816	-0.8899477701	)
(	0.5671824117	-0.1956145442	-0.8000244133	)
(	0.7344831154	-0.0795466954	-0.6739487195	)
(	0.8517300085	0.0618938984	-0.5203125387	)
(	0.9109329091	0.2190682944	-0.3495859228	)
(	0.9080572374	0.3812653173	-0.1734036087	)
(	0.8432989655	0.537431508	-0.0037721297	)
(	0.7210712628	0.6769243987	0.1477484091	)
(	0.5497037451	0.7902377795	0.2708321334	)
(	0.3408748256	0.8696495306	0.3570910908	)
(	0.1088158501	0.9097478725	0.4006468759	)
(	-0.1306587458	0.9078001695	0.3985312339	)
(	-0.361229164	0.8639391542	0.3508883424	)
(	-0.5671824117	0.7811538825	0.2609649856	)
(	-0.7344831154	0.6650860337	0.1348892917	)
(	-0.8517300085	0.5236454399	-0.018746889	)
(	-0.9109329091	0.3664710439	-0.1894735049	)
(	-0.9080572374	0.204274021	-0.3656558191	)
(	-0.8432989655	0.0481078303	-0.535287298	)
(	-0.7210712628	-0.0913850605	-0.6868078368	)
(	-0.5497037451	-0.2046984412	-0.8098915611	)
(	-0.3408748256	-0.2841101924	-0.8961505185	)
)

// ************************************************************************* //
