streetCanyon_CFDHAM_veg/system/vegetation/setset_trees.batch
cellSet dummy new boxToCell (64 4 120)(66 8 130)
cellZoneSet dummy new setToCellZone dummy

